Repository: 84000/data-translation-memory
Catalog: toh182-v2.tmx
Source language: bo
Languages: en

source: དཔལ་ལྡན་ཤངས་འཚམ་ཆ་བྱད་རྨད་དུ་བྱུང་བ་ལེགས། །
en: Glorious one with a beautiful and marvelous nose, this is excellent!

source: སྨྲ་མཁས་སྙན་ཤལ་གསེར་གྱི་འཕྱང་ཐག་འདྲ་བ་ལེགས། །
en: Eloquent one with earlobes like golden plumb lines, this is excellent!

source: མཆེ་བ་ཁ་བ་དུང་འདྲ་ལེགས་ལ་ཕྱག་འཚལ་ལོ། །
en: You with teeth white like snow or conch shells, this is excellent! Homage to you!

source: གཙོ་བོ་བགྲེས་པ་མགོན་པོ་ཁྱོད་ཀྱིས་དེ་རིང་དུ། །མི་རྣམས་སྦྱིན་པ་དབྱེ་བ་ལེགས་པར་གསུངས་པ་ལེགས། །
en: “O chief protector, this detailed exposition on generosity, Which you have expounded so well to these people today, is excellent!

source: སླར་ཞིང་ཚུལ་ཁྲིམས་བཟོད་པ་སྟོབས་དང་ཡེ་ཤེས་དང་། །ཐབས་དང་བསམ་གཏན་རྫུ་འཕྲུལ་སྨོན་ལམ་མཉན་པར་འཚལ། །
en: Now we wish to hear more about discipline, patience, power, Wisdom, skillful means, concentration, miracles, and aspiration.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: At all that the Blessed One had spoken,

source: བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། རིའི་ཕུག་དང་། ཟོམ་དང་། རི་སུལ་དང་། གསེབ་དང་། སྨན་ལྗོངས་ན་སེང་གེའི་མཆོག་རྣམ་པར་བསྒྱིངས་ཤིང་ང་རོ་རྣམ་པར་སྒྲོགས་པ་ལྟ་བུའི་མིའི་དབང་པོའི་གཙུག་གི་ནོར་བུ་ལ་སོགས་པ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷའི་བུ་དེ་དག་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: the bodhisattvas Mañjuśrīkumārabhūta, Avalokiteśvara, Crown Jewel of the Lord of Men Resembling a Sublime Lion Sporting and Roaring in Mountain Caves, Peaks, Clefts, Valleys, and Meadows, and the other bodhisattvas, along with the gods, the four great kings, and the world with all its gods, humans, demigods, and gandharvas, rejoiced and

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: praised the teachings of the Blessed One.

source: འཕགས་པ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Great Vehicle sūtra, “The Perfection of Generosity.”

source: རྒྱ་གར་གྱི་མཁན་པོ་པྲཛྙཱ་བརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: This was translated, edited, and finalized by the Indian scholar Prajñāvarman, the translator-editor venerable Yeshé Dé, and others.
